#Напишите функцию, которая принимает количество повторных запусков
#теста и значение таймаута. Количество повторных запусков должно
#находиться в диапазоне от 0 до 5, а таймаут должен быть положительным
#числом. Если переданные значения не соответствуют этим требованиям,
#самостоятельно создайте исключение ValueError с помощью raise и
#добавьте понятное описание причины ошибки. Вызов функции
# поместить в try/except и корректно обработать созданные
#исключения. Проверьте работу программы минимум на трёх наборах
#данных: корректные значения, отрицательный таймаут и слишком
#большое количество повторных запусков


def test_retry(count, timeout):

    if not (0 <= count <= 5):
        raise ValueError(f"Количество повторных запусков должно находиться от 0 до 5")

    if timeout <= 0:
        raise ValueError(f"Таймаут должен быть положительным числом.")

    print(f"Количество повторных запусков: {count}, Таймаут: {timeout}")


test_cases = [
    {
        "test": "корректные значения",
        "retries": 5,
        "timeout": 10
    },
    {
        "test": "слишком большое количество повторных запусков",
        "retries": 10,
        "timeout": 50
    },
    {
        "test": "отрицательный таймаут",
        "retries": 5,
        "timeout": -10
    }
]

for case in test_cases:
    print(f"\n'{case['test']}'")

    try:
        test_retry(case["retries"], case["timeout"])
    except ValueError as error:
        print(f"Ошибка валидации данных: {error}")
